#### Terraform Format and Style 🖌success
#### Terraform Initialization ⚙️success
#### Terraform Validation 🤖success
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```
</details>

#### Terraform Plan 📖success
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.common: Reading...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
data.terraform_remote_state.common: Read complete after 3s
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
module.pubsub_topic.google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/prd-youtube-data-api]
module.storage.google_storage_bucket.bucket: Refreshing state... [id=prd-youtube-data-api-385206-bucket]
module.scheduler.google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/prd-invoke-transfer]
module.bq_datasets.google_bigquery_dataset.dataset["videos"]: Refreshing state... [id=projects/youtube-data-api-385206/datasets/prd_videos]
module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/prd-youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.pubsub_topic.google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/prd-prd-youtube-data-api-dlq]
module.bq_datasets.google_bigquery_dataset_iam_member.bigquery_editor_role["videos"]: Refreshing state... [id=projects/youtube-data-api-385206/datasets/prd_videos/roles/bigquery.dataEditor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.bq_tables.google_bigquery_table.tables["videos/most_popular.yaml"]: Refreshing state... [id=projects/youtube-data-api-385206/datasets/prd_videos/tables/prd_most_popular]
module.storage.google_storage_bucket_iam_member.member: Refreshing state... [id=b/prd-youtube-data-api-385206-bucket/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.run.google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/prd-youtube-data-api-api]
module.run.google_cloud_run_service_iam_member.api_invoker: Refreshing state... [id=v1/projects/youtube-data-api-385206/locations/asia-northeast1/services/prd-youtube-data-api-api/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.pubsub_subscription.google_pubsub_subscription.main: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/prd-youtube-data-api-sub]
module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/prd-youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.pubsub_subscription.google_pubsub_subscription.main will be updated in-place
  ~ resource "google_pubsub_subscription" "main" {
        id                           = "projects/youtube-data-api-385206/subscriptions/prd-youtube-data-api-sub"
        name                         = "prd-youtube-data-api-sub"
        # (11 unchanged attributes hidden)

      ~ push_config {
          ~ push_endpoint = "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/load" -> "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.run.google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
        id                      = "projects/youtube-data-api-385206/locations/asia-northeast1/services/prd-youtube-data-api-api"
        name                    = "prd-youtube-data-api-api"
        # (30 unchanged attributes hidden)

      ~ template {
            # (9 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/prd-youtube-data-api-repository/prd-api-image:48dfd061ec44b5800152891fbbae1c376f1c247e" -> "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/prd-youtube-data-api-repository/prd-api-image:5b3057a188289347c9a80314fd5d148f9e2393a7"
                name        = null
                # (4 unchanged attributes hidden)

                # (11 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.scheduler.google_cloud_scheduler_job.invoke-transfer will be destroyed
  # (because google_cloud_scheduler_job.invoke-transfer is not in configuration)
  - resource "google_cloud_scheduler_job" "invoke-transfer" {
      - attempt_deadline = "180s" -> null
      - description      = "suggesting your lunch" -> null
      - id               = "projects/youtube-data-api-385206/locations/asia-northeast1/jobs/prd-invoke-transfer" -> null
      - name             = "prd-invoke-transfer" -> null
      - paused           = false -> null
      - project          = "youtube-data-api-385206" -> null
      - region           = "asia-northeast1" -> null
      - schedule         = "0 12 * * *" -> null
      - state            = "ENABLED" -> null
      - time_zone        = "Asia/Tokyo" -> null

      - http_target {
          - headers     = {} -> null
          - http_method = "POST" -> null
          - uri         = "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> null
            # (1 unchanged attribute hidden)

          - oidc_token {
              - audience              = "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> null
              - service_account_email = "cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com" -> null
            }
        }

      - retry_config {
          - max_backoff_duration = "3600s" -> null
          - max_doublings        = 5 -> null
          - max_retry_duration   = "0s" -> null
          - min_backoff_duration = "5s" -> null
          - retry_count          = 1 -> null
        }
    }

  # module.scheduler.google_cloud_scheduler_job.invoke_transfer["/invoke"] will be created
  + resource "google_cloud_scheduler_job" "invoke_transfer" {
      + description = "Invoke Cloud Run Transfer Job on Schedule"
      + id          = (known after apply)
      + name        = "prd-invoke-transfer"
      + paused      = false
      + project     = "youtube-data-api-385206"
      + region      = "asia-northeast1"
      + schedule    = "0 12 * * *"
      + state       = (known after apply)
      + time_zone   = "Asia/Tokyo"

      + http_target {
          + body        = "eyJhY3Rpb24iOiJ0cmFuc2ZlciIsInBhcmFtcyI6eyJjaGFydCI6Im1vc3RQb3B1bGFyIiwibWF4UmVzdWx0cyI6NTAsInBhcnQiOiJzbmlwcGV0LCBjb250ZW50RGV0YWlscywgc3RhdGlzdGljcyIsInByZWZpeCI6Im1vc3RfcG9wdWxhciJ9fQ=="
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke"

          + oidc_token {
              + audience              = "https://prd-youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke"
              + service_account_email = "cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

**Pusher: @Kamegrueon, Action: pull_request, Working Directory: ./terraform/common_stack, Workflow: deploy**
